djzenma/ECG-Heart-Monitor-STM32-TFLite/ai1.ioc
#MicroXplorer Configuration settings - do not modify
ADC1.Channel-0\#ChannelRegularConversion=ADC_CHANNEL_5
ADC1.IPParameters=master,NbrOfConversionFlag,Channel-0\#ChannelRegularConversion
ADC1.NbrOfConversionFlag=1
ADC1.master=1
File.Version=6
GPIO.groupedBy=
KeepUserPlacement=false
Mcu.Family=STM32L4
Mcu.IP0=ADC1
Mcu.IP1=CRC
Mcu.IP2=NVIC
Mcu.IP3=RCC
Mcu.IP4=SYS
Mcu.IP5=TIM15
Mcu.IP6=USART2
Mcu.IPNb=7
Mcu.Name=STM32L432K(B-C)Ux
Mcu.Package=UFQFPN32
Mcu.Pin0=PA0
Mcu.Pin1=PA2
Mcu.Pin10=VP_STMicroelectronics.X-CUBE-AI_VS_ArtificialOoIntelligenceJjApplication_5.0.0
Mcu.Pin2=PA3
Mcu.Pin3=PA13 (JTMS-SWDIO)
Mcu.Pin4=PA14 (JTCK-SWCLK)
Mcu.Pin5=PB3 (JTDO-TRACESWO)
Mcu.Pin6=VP_CRC_VS_CRC
Mcu.Pin7=VP_SYS_VS_Systick
Mcu.Pin8=VP_TIM15_VS_ClockSourceINT
Mcu.Pin9=VP_STMicroelectronics.X-CUBE-AI_VS_ArtificialOoIntelligenceJjXAaCUBEAaAI_5.0.0
Mcu.PinsNb=11
Mcu.ThirdParty0=STMicroelectronics.X-CUBE-AI.5.0.0
Mcu.ThirdPartyNb=1
Mcu.UserConstants=
Mcu.UserName=STM32L432KCUx
MxCube.Version=5.6.1
MxDb.Version=DB.5.0.60
NVIC.ADC1_IRQn=true\:0\:0\:false\:false\:true\:true\:true
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.ForceEnableDMAVector=true
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
NVIC.TIM1_BRK_TIM15_IRQn=true\:0\:0\:false\:false\:true\:true\:true
NVIC.USART2_IRQn=true\:0\:0\:false\:false\:true\:true\:true
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA0.Signal=ADCx_IN5
PA13\ (JTMS-SWDIO).Mode=Serial_Wire
PA13\ (JTMS-SWDIO).Signal=SYS_JTMS-SWDIO
PA14\ (JTCK-SWCLK).Mode=Serial_Wire
PA14\ (JTCK-SWCLK).Signal=SYS_JTCK-SWCLK
PA2.Mode=Asynchronous
PA2.Signal=USART2_TX
PA3.Mode=Asynchronous
PA3.Signal=USART2_RX
PB3\ (JTDO-TRACESWO).Locked=true
PB3\ (JTDO-TRACESWO).Signal=GPIO_Output
PinOutPanel.RotationAngle=0
ProjectManager.AskForMigrate=true
ProjectManager.BackupPrevious=false
ProjectManager.CompilerOptimize=6
ProjectManager.ComputerToolchain=false
ProjectManager.CoupleFile=false
ProjectManager.CustomerFirmwarePackage=
ProjectManager.DefaultFWLocation=true
ProjectManager.DeletePrevious=true
ProjectManager.DeviceId=STM32L432KCUx
ProjectManager.FirmwarePackage=STM32Cube FW_L4 V1.15.1
ProjectManager.FreePins=false
ProjectManager.HalAssertFull=false
ProjectManager.HeapSize=0x4000
ProjectManager.KeepUserCode=true
ProjectManager.LastFirmware=true
ProjectManager.LibraryCopy=1
ProjectManager.MainLocation=Src
ProjectManager.NoMain=false
ProjectManager.PreviousToolchain=
ProjectManager.ProjectBuild=false
ProjectManager.ProjectFileName=ai1.ioc
ProjectManager.ProjectName=ai1
ProjectManager.StackSize=0x4000
ProjectManager.TargetToolchain=MDK-ARM V5.27
ProjectManager.ToolChainLocation=
ProjectManager.UnderRoot=false
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-SystemClock_Config-RCC-false-HAL-false,3-MX_ADC1_Init-ADC1-false-HAL-true,4-MX_CRC_Init-CRC-false-HAL-true,5-MX_USART2_UART_Init-USART2-false-HAL-true,6-MX_TIM1_Init-TIM1-false-HAL-true,7-MX_X_CUBE_AI_Init-STMicroelectronics.X-CUBE-AI.5.0.0-false-HAL-false,8-MX_X_CUBE_AI_Process-STMicroelectronics.X-CUBE-AI.5.0.0-false-HAL-false
RCC.ADCFreq_Value=32000000
RCC.AHBFreq_Value=40000000
RCC.APB1CLKDivider=RCC_HCLK_DIV16
RCC.APB1Freq_Value=2500000
RCC.APB1TimFreq_Value=5000000
RCC.APB2CLKDivider=RCC_HCLK_DIV8
RCC.APB2Freq_Value=5000000
RCC.APB2TimFreq_Value=10000000
RCC.CortexFreq_Value=40000000
RCC.FCLKCortexFreq_Value=40000000
RCC.FamilyName=M
RCC.HCLKFreq_Value=40000000
RCC.HSE_VALUE=8000000
RCC.HSI48_VALUE=48000000
RCC.HSI_VALUE=16000000
RCC.I2C1Freq_Value=2500000
RCC.I2C3Freq_Value=2500000
RCC.IPParameters=ADCFreq_Value,AHBFreq_Value,APB1CLKDivider,APB1Freq_Value,APB1TimFreq_Value,APB2CLKDivider,APB2Freq_Value,APB2TimFreq_Value,CortexFreq_Value,FCLKCortexFreq_Value,FamilyName,HCLKFreq_Value,HSE_VALUE,HSI48_VALUE,HSI_VALUE,I2C1Freq_Value,I2C3Freq_Value,LPTIM1Freq_Value,LPTIM2Freq_Value,LPUART1Freq_Value,LSCOPinFreq_Value,LSE_VALUE,LSI_VALUE,MCO1PinFreq_Value,MSI_VALUE,PLLN,PLLPoutputFreq_Value,PLLQoutputFreq_Value,PLLRCLKFreq_Value,PLLSAI1N,PLLSAI1PoutputFreq_Value,PLLSAI1QoutputFreq_Value,PLLSAI1RoutputFreq_Value,PWRFreq_Value,RNGFreq_Value,SAI1Freq_Value,SWPMI1Freq_Value,SYSCLKFreq_VALUE,SYSCLKSource,USART1Freq_Value,USART2Freq_Value,USBFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value,VCOSAI1OutputFreq_Value
RCC.LPTIM1Freq_Value=2500000
RCC.LPTIM2Freq_Value=2500000
RCC.LPUART1Freq_Value=2500000
RCC.LSCOPinFreq_Value=32000
RCC.LSE_VALUE=32768
RCC.LSI_VALUE=32000
RCC.MCO1PinFreq_Value=40000000
RCC.MSI_VALUE=4000000
RCC.PLLN=20
RCC.PLLPoutputFreq_Value=11428571.42857143
RCC.PLLQoutputFreq_Value=40000000
RCC.PLLRCLKFreq_Value=40000000
RCC.PLLSAI1N=16
RCC.PLLSAI1PoutputFreq_Value=9142857.142857144
RCC.PLLSAI1QoutputFreq_Value=32000000
RCC.PLLSAI1RoutputFreq_Value=32000000
RCC.PWRFreq_Value=40000000
RCC.RNGFreq_Value=32000000
RCC.SAI1Freq_Value=9142857.142857144
RCC.SWPMI1Freq_Value=2500000
RCC.SYSCLKFreq_VALUE=40000000
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
RCC.USART1Freq_Value=5000000
RCC.USART2Freq_Value=2500000
RCC.USBFreq_Value=32000000
RCC.VCOInputFreq_Value=4000000
RCC.VCOOutputFreq_Value=80000000
RCC.VCOSAI1OutputFreq_Value=64000000
SH.ADCx_IN5.0=ADC1_IN5,IN5-Single-Ended
SH.ADCx_IN5.ConfNb=1
STMicroelectronics.X-CUBE-AI.5.0.0.ActivationBufferSizeList=400
STMicroelectronics.X-CUBE-AI.5.0.0.ApplicationCcArtificialOoIntelligenceJjApplication=ApplicationTemplate
STMicroelectronics.X-CUBE-AI.5.0.0.ArtificialOoIntelligenceJjApplication_Checked=true
STMicroelectronics.X-CUBE-AI.5.0.0.ArtificialOoIntelligenceJjXAaCUBEAaAI_Checked=true
STMicroelectronics.X-CUBE-AI.5.0.0.HeapSize=0x4000
STMicroelectronics.X-CUBE-AI.5.0.0.IPParameters=XAaCUBEAaAICcArtificialOoIntelligenceJjCore,ApplicationCcArtificialOoIntelligenceJjApplication,HeapSize,StackSize,ModelHashList,ModelNameList,WorkingBufferStartAddrList,InternalRamActivationBufferMaxSize,ActivationBufferSizeList,MaximumNumberOfInputLayer,MaximumNumberOfOutputLayer,MaximumSizeOfInputLayer,MaximumSizeOfOutputLayer,ModelName-900e614369018c1198ceea4ec6b82cbeea6cc429474315437d1866074cb1948e,ModelType-900e614369018c1198ceea4ec6b82cbeea6cc429474315437d1866074cb1948e,ModelKind-900e614369018c1198ceea4ec6b82cbeea6cc429474315437d1866074cb1948e,LatestDirectoryUsed-900e614369018c1198ceea4ec6b82cbeea6cc429474315437d1866074cb1948e,ModelFlashOccupation-900e614369018c1198ceea4ec6b82cbeea6cc429474315437d1866074cb1948e,ModelRamOccupation-900e614369018c1198ceea4ec6b82cbeea6cc429474315437d1866074cb1948e,ModelMacc-900e614369018c1198ceea4ec6b82cbeea6cc429474315437d1866074cb1948e,ModelActualCompression-900e614369018c1198ceea4ec6b82cbeea6cc429474315437d1866074cb1948e,ModelCompression-900e614369018c1198ceea4ec6b82cbeea6cc429474315437d1866074cb1948e,ModelStructureFile-900e614369018c1198ceea4ec6b82cbeea6cc429474315437d1866074cb1948e,NNModelInformation_AchievedCompression-900e614369018c1198ceea4ec6b82cbeea6cc429474315437d1866074cb1948e,NNModelInformation_CompressionFactor-900e614369018c1198ceea4ec6b82cbeea6cc429474315437d1866074cb1948e,NNModelInformation_EvaluationStatus-900e614369018c1198ceea4ec6b82cbeea6cc429474315437d1866074cb1948e,NNModelInformation_HeapSizeNeeded-900e614369018c1198ceea4ec6b82cbeea6cc429474315437d1866074cb1948e,NNModelInformation_ModelInSizeByName-900e614369018c1198ceea4ec6b82cbeea6cc429474315437d1866074cb1948e,NNModelInformation_ModelMacc-900e614369018c1198ceea4ec6b82cbeea6cc429474315437d1866074cb1948e,NNModelInformation_ModelName-900e614369018c1198ceea4ec6b82cbeea6cc429474315437d1866074cb1948e,NNModelInformation_ModelOutSizeByName-900e614369018c1198ceea4ec6b82cbeea6cc429474315437d1866074cb1948e,NNModelInformation_ModelRam-900e614369018c1198ceea4ec6b82cbeea6cc429474315437d1866074cb1948e,NNModelInformation_ModelRom-900e614369018c1198ceea4ec6b82cbeea6cc429474315437d1866074cb1948e,NNModelInformation_ModelSize-900e614369018c1198ceea4ec6b82cbeea6cc429474315437d1866074cb1948e,NNModelInformation_NbOfParameters-900e614369018c1198ceea4ec6b82cbeea6cc429474315437d1866074cb1948e
STMicroelectronics.X-CUBE-AI.5.0.0.InternalRamActivationBufferMaxSize=AI_NETWORK_DATA_ACTIVATIONS_SIZE
STMicroelectronics.X-CUBE-AI.5.0.0.LatestDirectoryUsed-900e614369018c1198ceea4ec6b82cbeea6cc429474315437d1866074cb1948e=C\:\\Users\\IEUser\\Desktop
STMicroelectronics.X-CUBE-AI.5.0.0.MaximumNumberOfInputLayer=1
STMicroelectronics.X-CUBE-AI.5.0.0.MaximumNumberOfOutputLayer=1
STMicroelectronics.X-CUBE-AI.5.0.0.MaximumSizeOfInputLayer=748
STMicroelectronics.X-CUBE-AI.5.0.0.MaximumSizeOfOutputLayer=20
STMicroelectronics.X-CUBE-AI.5.0.0.ModelActualCompression-900e614369018c1198ceea4ec6b82cbeea6cc429474315437d1866074cb1948e=0.0
STMicroelectronics.X-CUBE-AI.5.0.0.ModelCompression-900e614369018c1198ceea4ec6b82cbeea6cc429474315437d1866074cb1948e=8
STMicroelectronics.X-CUBE-AI.5.0.0.ModelFlashOccupation-900e614369018c1198ceea4ec6b82cbeea6cc429474315437d1866074cb1948e=6692
STMicroelectronics.X-CUBE-AI.5.0.0.ModelHashList=900e614369018c1198ceea4ec6b82cbeea6cc429474315437d1866074cb1948e
STMicroelectronics.X-CUBE-AI.5.0.0.ModelKind-900e614369018c1198ceea4ec6b82cbeea6cc429474315437d1866074cb1948e=KERAS
STMicroelectronics.X-CUBE-AI.5.0.0.ModelMacc-900e614369018c1198ceea4ec6b82cbeea6cc429474315437d1866074cb1948e=12275
STMicroelectronics.X-CUBE-AI.5.0.0.ModelName-900e614369018c1198ceea4ec6b82cbeea6cc429474315437d1866074cb1948e=network
STMicroelectronics.X-CUBE-AI.5.0.0.ModelNameList=network
STMicroelectronics.X-CUBE-AI.5.0.0.ModelRamOccupation-900e614369018c1198ceea4ec6b82cbeea6cc429474315437d1866074cb1948e=400
STMicroelectronics.X-CUBE-AI.5.0.0.ModelStructureFile-900e614369018c1198ceea4ec6b82cbeea6cc429474315437d1866074cb1948e=C\:\\Users\\IEUser\\Desktop\\my_model.h5
STMicroelectronics.X-CUBE-AI.5.0.0.ModelType-900e614369018c1198ceea4ec6b82cbeea6cc429474315437d1866074cb1948e=Saved model
STMicroelectronics.X-CUBE-AI.5.0.0.NNModelInformation_AchievedCompression-900e614369018c1198ceea4ec6b82cbeea6cc429474315437d1866074cb1948e=0.0
STMicroelectronics.X-CUBE-AI.5.0.0.NNModelInformation_CompressionFactor-900e614369018c1198ceea4ec6b82cbeea6cc429474315437d1866074cb1948e=-0.8629250307251126
STMicroelectronics.X-CUBE-AI.5.0.0.NNModelInformation_EvaluationStatus-900e614369018c1198ceea4ec6b82cbeea6cc429474315437d1866074cb1948e=NOT EVALUATED
STMicroelectronics.X-CUBE-AI.5.0.0.NNModelInformation_HeapSizeNeeded-900e614369018c1198ceea4ec6b82cbeea6cc429474315437d1866074cb1948e=2048
STMicroelectronics.X-CUBE-AI.5.0.0.NNModelInformation_ModelInSizeByName-900e614369018c1198ceea4ec6b82cbeea6cc429474315437d1866074cb1948e={input_0\=748}
STMicroelectronics.X-CUBE-AI.5.0.0.NNModelInformation_ModelMacc-900e614369018c1198ceea4ec6b82cbeea6cc429474315437d1866074cb1948e=12275
STMicroelectronics.X-CUBE-AI.5.0.0.NNModelInformation_ModelName-900e614369018c1198ceea4ec6b82cbeea6cc429474315437d1866074cb1948e=network
STMicroelectronics.X-CUBE-AI.5.0.0.NNModelInformation_ModelOutSizeByName-900e614369018c1198ceea4ec6b82cbeea6cc429474315437d1866074cb1948e={dense_3_nl\=20}
STMicroelectronics.X-CUBE-AI.5.0.0.NNModelInformation_ModelRam-900e614369018c1198ceea4ec6b82cbeea6cc429474315437d1866074cb1948e=400
STMicroelectronics.X-CUBE-AI.5.0.0.NNModelInformation_ModelRom-900e614369018c1198ceea4ec6b82cbeea6cc429474315437d1866074cb1948e=6692
STMicroelectronics.X-CUBE-AI.5.0.0.NNModelInformation_ModelSize-900e614369018c1198ceea4ec6b82cbeea6cc429474315437d1866074cb1948e=48820
STMicroelectronics.X-CUBE-AI.5.0.0.NNModelInformation_NbOfParameters-900e614369018c1198ceea4ec6b82cbeea6cc429474315437d1866074cb1948e=12205
STMicroelectronics.X-CUBE-AI.5.0.0.StackSize=0x4000
STMicroelectronics.X-CUBE-AI.5.0.0.WorkingBufferStartAddrList=0xFFFFFFFF
STMicroelectronics.X-CUBE-AI.5.0.0.XAaCUBEAaAICcArtificialOoIntelligenceJjCore=true
STMicroelectronics.X-CUBE-AI.5.0.0_SwParameter=XAaCUBEAaAICcArtificialOoIntelligenceJjCore\:true;ApplicationCcArtificialOoIntelligenceJjApplication\:ApplicationTemplate;
TIM15.IPParameters=TIM_MasterOutputTrigger,Prescaler,Period
TIM15.Period=8
TIM15.Prescaler=10000
TIM15.TIM_MasterOutputTrigger=TIM_TRGO_UPDATE
USART2.BaudRate=9600
USART2.IPParameters=VirtualMode-Asynchronous,BaudRate
USART2.VirtualMode-Asynchronous=VM_ASYNC
VP_CRC_VS_CRC.Mode=CRC_Activate
VP_CRC_VS_CRC.Signal=CRC_VS_CRC
VP_STMicroelectronics.X-CUBE-AI_VS_ArtificialOoIntelligenceJjApplication_5.0.0.Mode=ArtificialOoIntelligenceJjApplication
VP_STMicroelectronics.X-CUBE-AI_VS_ArtificialOoIntelligenceJjApplication_5.0.0.Signal=STMicroelectronics.X-CUBE-AI_VS_ArtificialOoIntelligenceJjApplication_5.0.0
VP_STMicroelectronics.X-CUBE-AI_VS_ArtificialOoIntelligenceJjXAaCUBEAaAI_5.0.0.Mode=ArtificialOoIntelligenceJjXAaCUBEAaAI
VP_STMicroelectronics.X-CUBE-AI_VS_ArtificialOoIntelligenceJjXAaCUBEAaAI_5.0.0.Signal=STMicroelectronics.X-CUBE-AI_VS_ArtificialOoIntelligenceJjXAaCUBEAaAI_5.0.0
VP_SYS_VS_Systick.Mode=SysTick
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
VP_TIM15_VS_ClockSourceINT.Mode=Internal
VP_TIM15_VS_ClockSourceINT.Signal=TIM15_VS_ClockSourceINT
board=custom
